
# rjvv

# вывод дынных
# print(20)
# print(5 + 3)
# print(5 - 3)
# print(5 * 3)
# print(30 / 3)



# создание и вывод переменной
# num = 4
# print(num)
# перезапись переменной 
# num = 9
# print(num)
# num = 1
# print(num + 10)



# пример названия переменных
# red_car = 5
# redСarSpeed = 5
# w0orl6d2 = 0



# запятая в python
# num_2 = 8
# print("hello world" , 1222 , num_2)



# типы данных
# print("int =" , 5) # int - Целые числа
# print("float =" , 5.2) # float - Числа с плавающей точкой
# print("str =" , 'qww' , "2rr22") # str - Строка
# print("bool =" , True , False) # boot - Логические значения
# print("null =" , None) # NoneType - Ничего



# пример использование None
# num_3 = None
# num_3 = 54
# print(num_3)



# допзапись переменной 
# num = num + 3
# print(num)



# строка в переменной 
# str_num = "wdwudbuwdu"
# print(str_num)
# str_num = 5
# print(str_num)



# арифметические операторы
print("6 + 3 =" , 6 + 3) # Сумма
print("6 - 3 =" , 6 - 3) # Вычитание
print("6 * 3 =" , 6 * 3) # Умножение
print("6 ** 3 =" , 6 ** 3) # Возведение в степень
print("10 / 3 =" , 10 / 3) # Деление
print("10 // 3 =" , 10 // 3) #деление без остатка 
print("10 % 3 =" , 10 % 3) #остаток от деления








# dz
# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.

# задача 3
# За один день хомячок съедает K грамм корма. 
# Написать программу, определяющую закупку корма в килограммах на 30 дней.

# задача 4 
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю

# задача 5
# Пользователь вводит с клавиатуры время 
# в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию

# задача 6
# Пользователь вводит с клавиатуры три числа. 
# Посчитать их сумму, произведение и среднее арифметическое.


